In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [8]:
df_new = df[['AreaName', 1980, 1981, 1982]]
df_new = df_new.head(5)

# Check If Entire Column is UNIQUE or not

In [11]:
df_new

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
2   Africa    80    67    71
3  Oceania     0     1     0
4   Europe     0     0     0

In [14]:
df_new["AreaName"].is_unique # COlumn have 2 values of "Eirope"

False

In [15]:
df_new[1980].is_unique # Column have 2 values of 0

False

In [18]:
df_new.loc[4] = ["Europe", 2, 0, 0]

In [19]:
df_new

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
2   Africa    80    67    71
3  Oceania     0     1     0
4   Europe     2     0     0

In [20]:
df_new[1980].is_unique # Column doesn't have any duplicate values

True

# Find UNIQUE values from Column

In [21]:
df_new

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
2   Africa    80    67    71
3  Oceania     0     1     0
4   Europe     2     0     0

In [23]:
df_new["AreaName"].unique()

array(['Asia', 'Europe', 'Africa', 'Oceania'], dtype=object)

In [24]:
df_new["AreaName"].unique().tolist()

['Asia', 'Europe', 'Africa', 'Oceania']

#### Non PANDAS approach

In [26]:
df_new["AreaName"] #This is a series

0       Asia
1     Europe
2     Africa
3    Oceania
4     Europe
Name: AreaName, dtype: object

In [27]:
list(df_new["AreaName"]) # Series is converted into List

['Asia', 'Europe', 'Africa', 'Oceania', 'Europe']

In [28]:
set(list(df_new["AreaName"]))  # Apply set on the List

{'Africa', 'Asia', 'Europe', 'Oceania'}

In [29]:
list(set(list(df_new["AreaName"])))  # Convert set into List

['Europe', 'Africa', 'Asia', 'Oceania']

# FInd out How many Unique are in the DataFrame

#### Only can be applied on DataFrame

In [34]:
df= pd.DataFrame({"A" : [14, 4, 5, 4, 1],
                  "B" : [5, 2, 54, 3, 2],
                  "C" : [20, 20, 7, 3, 8],
                  "D" : [14, 3, 6, 2, 7]})

In [35]:
df

    A   B   C   D
0  14   5  20  14
1   4   2  20   3
2   5  54   7   6
3   4   3   3   2
4   1   2   8   7

In [36]:
df.nunique(axis = 1)  # ROW wise

0    3
1    4
2    4
3    3
4    4
dtype: int64

In [37]:
df.nunique(axis = 0)  # COLUMN wise

A    4
B    4
C    4
D    5
dtype: int64